# St7SetBrickColours

Sets the colours to be used for given brick display types, where such are required.

long St7SetBrickColours(long uID, long* Colours, long NumCol)
Input Parameters
uID
Strand7 model file ID.
Colours[0..1]
[ipBrickFillColour] – The fill colour.
[ipBrickLineColour] – The outline colour.
See also RGB Colours.
NumCol
The size of Colours.